# Вывести таблицу умножения в виде.
# 1 x 1 = 1
# 1 x 2 = 2
# ..
# 1 x 10 = 10
# —
# 2 x 1 = 2
# 2 x 2 = 4
# …
# N x 10 = 10N
#
# Параметр N задается с клавиатуры (или в виде аргумента скрипта, по желанию).
# Между разделами вывести разделитель в виде 5 девисов.

N = int(input('Введите до какого числа выводить таблицу умножения: '))
mul1 = 1  # Первый множитель
mul2 = 1  # Второй множитель

while mul1 <= N:
    prod = mul1 * mul2
    print(f'{mul1} x {mul2} = {prod}')
    mul2 += 1
    if mul2 > 10:
        mul1 += 1
        mul2 = 1
        print('-----')
