# Написать программу, которая будет содержать функцию для получения имени файла из полного пути до него.
# При вызове функции в качестве аргумента должно передаваться путь и имя файла с расширением.
# В функции необходимо реализовать поиск имени файла (с расширением), а затем «выделение» имени файла (без расширения).
# Расширений может быть несколько (например testfile.tar.gz).

import os


def get_file_name(path, f_name):
    for f in os.listdir(path):  # проходимся по файлам в директории
        if f == f_name: # ищем нужный файл
                # print(str(f_name).partition('.')[0])
                print(str(f).partition('.')[0])

