# Написать программу, которая запрашивает у пользователя ввод числа.
# На введенное число она отвечает сообщением, целое оно или дробное.
# Если дробное — необходимо далее выполнить сравнение чисел до и после запятой.
# Если они совпадают, программа должна возвращать значение True, иначе False.

num = float(input('Введите число: '))

if num % 1 == 0:
    print(f'{round(num)} является целым числом')
else:
    print(f'{num} является дробным')
    num_parts = str(num).partition('.')
    # print(num_parts)
    if num_parts[0] == num_parts[2]:
        print(True)
    else:
        print(False)